## Staging: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 27 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `aws_ssm_parameter.approval_request_template_id`                     |
|        | `aws_ssm_parameter.approved_request_template_id`                     |
|        | `aws_ssm_parameter.approver_delete_template_id`                      |
|        | `aws_ssm_parameter.db_host`                                          |
|        | `aws_ssm_parameter.delete_saas_request_template_id`                  |
|        | `aws_ssm_parameter.denied_request_template_id`                       |
|        | `aws_ssm_parameter.django_secret_key`                                |
|        | `aws_ssm_parameter.edit_request_template_id`                         |
|        | `aws_ssm_parameter.environment`                                      |
|        | `aws_ssm_parameter.internal_ops_request_more_info_template_id`       |
|        | `aws_ssm_parameter.notify_api_key`                                   |
|        | `aws_ssm_parameter.notify_url`                                       |
|        | `aws_ssm_parameter.postgres_db`                                      |
|        | `aws_ssm_parameter.postgres_password`                                |
|        | `aws_ssm_parameter.postgres_user`                                    |
|        | `aws_ssm_parameter.request_s32_approved_internal_ops_template_id`    |
|        | `aws_ssm_parameter.request_s32_approved_template_id`                 |
|        | `aws_ssm_parameter.request_s32_denied_internal_ops_template_id`      |
|        | `aws_ssm_parameter.request_s32_denied_template_id`                   |
|        | `aws_ssm_parameter.requestor_s32approval_pending_review_template_id` |
|        | `aws_ssm_parameter.s32_approval_requested_template_id`               |
|        | `aws_ssm_parameter.saas_submission_edit_template_id`                 |
|        | `aws_ssm_parameter.saas_submission_template_id`                      |
|        | `aws_ssm_parameter.site_id`                                          |
|        | `aws_ssm_parameter.social_application_client_id`                     |
|        | `aws_ssm_parameter.social_application_secret_key`                    |
|        | `aws_ssm_parameter.testing_feature_flag`                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.approval_request_template_id will be created
  + resource "aws_ssm_parameter" "approval_request_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "approval_request_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.approved_request_template_id will be created
  + resource "aws_ssm_parameter" "approved_request_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "approved_request_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.approver_delete_template_id will be created
  + resource "aws_ssm_parameter" "approver_delete_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "approver_delete_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.db_host will be created
  + resource "aws_ssm_parameter" "db_host" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "db_host"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.delete_saas_request_template_id will be created
  + resource "aws_ssm_parameter" "delete_saas_request_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "delete_saas_request_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.denied_request_template_id will be created
  + resource "aws_ssm_parameter" "denied_request_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "denied_request_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.django_secret_key will be created
  + resource "aws_ssm_parameter" "django_secret_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "django_secret_key"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.edit_request_template_id will be created
  + resource "aws_ssm_parameter" "edit_request_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "edit_request_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.environment will be created
  + resource "aws_ssm_parameter" "environment" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "environment"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.internal_ops_request_more_info_template_id will be created
  + resource "aws_ssm_parameter" "internal_ops_request_more_info_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "internal_ops_request_more_info_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.notify_api_key will be created
  + resource "aws_ssm_parameter" "notify_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "notify_api_key"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.notify_url will be created
  + resource "aws_ssm_parameter" "notify_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "notify_url"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.postgres_db will be created
  + resource "aws_ssm_parameter" "postgres_db" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "postgres_db"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.postgres_password will be created
  + resource "aws_ssm_parameter" "postgres_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "postgres_password"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.postgres_user will be created
  + resource "aws_ssm_parameter" "postgres_user" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "postgres_user"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.request_s32_approved_internal_ops_template_id will be created
  + resource "aws_ssm_parameter" "request_s32_approved_internal_ops_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "request_s32_approved_internal_ops_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.request_s32_approved_template_id will be created
  + resource "aws_ssm_parameter" "request_s32_approved_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "request_s32_approved_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.request_s32_denied_internal_ops_template_id will be created
  + resource "aws_ssm_parameter" "request_s32_denied_internal_ops_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "request_s32_denied_internal_ops_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.request_s32_denied_template_id will be created
  + resource "aws_ssm_parameter" "request_s32_denied_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "request_s32_denied_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.requestor_s32approval_pending_review_template_id will be created
  + resource "aws_ssm_parameter" "requestor_s32approval_pending_review_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "requestor_s32approval_pending_review_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.s32_approval_requested_template_id will be created
  + resource "aws_ssm_parameter" "s32_approval_requested_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "s32_approval_requested_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.saas_submission_edit_template_id will be created
  + resource "aws_ssm_parameter" "saas_submission_edit_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "saas_submission_edit_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.saas_submission_template_id will be created
  + resource "aws_ssm_parameter" "saas_submission_template_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "saas_submission_template_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.site_id will be created
  + resource "aws_ssm_parameter" "site_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "site_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.social_application_client_id will be created
  + resource "aws_ssm_parameter" "social_application_client_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "social_application_client_id"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.social_application_secret_key will be created
  + resource "aws_ssm_parameter" "social_application_secret_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "social_application_secret_key"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.testing_feature_flag will be created
  + resource "aws_ssm_parameter" "testing_feature_flag" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "testing_feature_flag"
      + tags           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  # Warning: this attribute value will be marked as sensitive and will not
  # display in UI output after applying this change.
  ~ saas_app_config_value = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
